Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG01/include/component/tcc.h
#define TCC_STATUS_FAULT_Pos                  _UINT32_(14)                                         /* (TCC_STATUS Position) Non-Recoverable Fault x State */
#define TCC_STATUS_FAULT_Msk                  (_UINT32_(0x3) << TCC_STATUS_FAULT_Pos)              /* (TCC_STATUS Mask) FAULT */
#define TCC_STATUS_FAULT(value)               (TCC_STATUS_FAULT_Msk & (_UINT32_(value) << TCC_STATUS_FAULT_Pos)) 
#define TCC_STATUS_CCBUFV_Pos                 _UINT32_(16)                                         /* (TCC_STATUS Position) Compare Channel x Buffer Valid */
#define TCC_STATUS_CCBUFV_Msk                 (_UINT32_(0x3F) << TCC_STATUS_CCBUFV_Pos)            /* (TCC_STATUS Mask) CCBUFV */
#define TCC_STATUS_CCBUFV(value)              (TCC_STATUS_CCBUFV_Msk & (_UINT32_(value) << TCC_STATUS_CCBUFV_Pos)) 
#define TCC_STATUS_CMP_Pos                    _UINT32_(24)                                         /* (TCC_STATUS Position) Compare Channel 5 Value */
#define TCC_STATUS_CMP_Msk                    (_UINT32_(0x3F) << TCC_STATUS_CMP_Pos)               /* (TCC_STATUS Mask) CMP */
#define TCC_STATUS_CMP(value)                 (TCC_STATUS_CMP_Msk & (_UINT32_(value) << TCC_STATUS_CMP_Pos)) 

/* -------- TCC_SYNCBUSY : (TCC Offset: 0x08) ( R/ 32) Synchronization Busy -------- */
#define TCC_SYNCBUSY_RESETVALUE               _UINT32_(0x00)                                       /*  (TCC_SYNCBUSY) Synchronization Busy  Reset Value */

#define TCC_SYNCBUSY_SWRST_Pos                _UINT32_(0)                                          /* (TCC_SYNCBUSY) Swrst Busy Position */
#define TCC_SYNCBUSY_SWRST_Msk                (_UINT32_(0x1) << TCC_SYNCBUSY_SWRST_Pos)            /* (TCC_SYNCBUSY) Swrst Busy Mask */
#define TCC_SYNCBUSY_SWRST(value)             (TCC_SYNCBUSY_SWRST_Msk & (_UINT32_(value) << TCC_SYNCBUSY_SWRST_Pos)) /* Assigment of value for SWRST in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_ENABLE_Pos               _UINT32_(1)                                          /* (TCC_SYNCBUSY) Enable Busy Position */
#define TCC_SYNCBUSY_ENABLE_Msk               (_UINT32_(0x1) << TCC_SYNCBUSY_ENABLE_Pos)           /* (TCC_SYNCBUSY) Enable Busy Mask */
#define TCC_SYNCBUSY_ENABLE(value)            (TCC_SYNCBUSY_ENABLE_Msk & (_UINT32_(value) << TCC_SYNCBUSY_ENABLE_Pos)) /* Assigment of value for ENABLE in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_CTRLB_Pos                _UINT32_(2)                                          /* (TCC_SYNCBUSY) Ctrlb Busy Position */
#define TCC_SYNCBUSY_CTRLB_Msk                (_UINT32_(0x1) << TCC_SYNCBUSY_CTRLB_Pos)            /* (TCC_SYNCBUSY) Ctrlb Busy Mask */
#define TCC_SYNCBUSY_CTRLB(value)             (TCC_SYNCBUSY_CTRLB_Msk & (_UINT32_(value) << TCC_SYNCBUSY_CTRLB_Pos)) /* Assigment of value for CTRLB in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_STATUS_Pos               _UINT32_(3)                                          /* (TCC_SYNCBUSY) Status Busy Position */
#define TCC_SYNCBUSY_STATUS_Msk               (_UINT32_(0x1) << TCC_SYNCBUSY_STATUS_Pos)           /* (TCC_SYNCBUSY) Status Busy Mask */
#define TCC_SYNCBUSY_STATUS(value)            (TCC_SYNCBUSY_STATUS_Msk & (_UINT32_(value) << TCC_SYNCBUSY_STATUS_Pos)) /* Assigment of value for STATUS in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_COUNT_Pos                _UINT32_(4)                                          /* (TCC_SYNCBUSY) Count Busy Position */
#define TCC_SYNCBUSY_COUNT_Msk                (_UINT32_(0x1) << TCC_SYNCBUSY_COUNT_Pos)            /* (TCC_SYNCBUSY) Count Busy Mask */
#define TCC_SYNCBUSY_COUNT(value)             (TCC_SYNCBUSY_COUNT_Msk & (_UINT32_(value) << TCC_SYNCBUSY_COUNT_Pos)) /* Assigment of value for COUNT in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_PATT_Pos                 _UINT32_(5)                                          /* (TCC_SYNCBUSY) Pattern Busy Position */
#define TCC_SYNCBUSY_PATT_Msk                 (_UINT32_(0x1) << TCC_SYNCBUSY_PATT_Pos)             /* (TCC_SYNCBUSY) Pattern Busy Mask */
#define TCC_SYNCBUSY_PATT(value)              (TCC_SYNCBUSY_PATT_Msk & (_UINT32_(value) << TCC_SYNCBUSY_PATT_Pos)) /* Assigment of value for PATT in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_WAVE_Pos                 _UINT32_(6)                                          /* (TCC_SYNCBUSY) Wave Busy Position */
#define TCC_SYNCBUSY_WAVE_Msk                 (_UINT32_(0x1) << TCC_SYNCBUSY_WAVE_Pos)             /* (TCC_SYNCBUSY) Wave Busy Mask */
#define TCC_SYNCBUSY_WAVE(value)              (TCC_SYNCBUSY_WAVE_Msk & (_UINT32_(value) << TCC_SYNCBUSY_WAVE_Pos)) /* Assigment of value for WAVE in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_PER_Pos                  _UINT32_(7)                                          /* (TCC_SYNCBUSY) Period Busy Position */
#define TCC_SYNCBUSY_PER_Msk                  (_UINT32_(0x1) << TCC_SYNCBUSY_PER_Pos)              /* (TCC_SYNCBUSY) Period Busy Mask */
#define TCC_SYNCBUSY_PER(value)               (TCC_SYNCBUSY_PER_Msk & (_UINT32_(value) << TCC_SYNCBUSY_PER_Pos)) /* Assigment of value for PER in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_CC0_Pos                  _UINT32_(8)                                          /* (TCC_SYNCBUSY) Compare Channel 0 Busy Position */
#define TCC_SYNCBUSY_CC0_Msk                  (_UINT32_(0x1) << TCC_SYNCBUSY_CC0_Pos)              /* (TCC_SYNCBUSY) Compare Channel 0 Busy Mask */
#define TCC_SYNCBUSY_CC0(value)               (TCC_SYNCBUSY_CC0_Msk & (_UINT32_(value) << TCC_SYNCBUSY_CC0_Pos)) /* Assigment of value for CC0 in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_CC1_Pos                  _UINT32_(9)                                          /* (TCC_SYNCBUSY) Compare Channel 1 Busy Position */
#define TCC_SYNCBUSY_CC1_Msk                  (_UINT32_(0x1) << TCC_SYNCBUSY_CC1_Pos)              /* (TCC_SYNCBUSY) Compare Channel 1 Busy Mask */
#define TCC_SYNCBUSY_CC1(value)               (TCC_SYNCBUSY_CC1_Msk & (_UINT32_(value) << TCC_SYNCBUSY_CC1_Pos)) /* Assigment of value for CC1 in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_CC2_Pos                  _UINT32_(10)                                         /* (TCC_SYNCBUSY) Compare Channel 2 Busy Position */
#define TCC_SYNCBUSY_CC2_Msk                  (_UINT32_(0x1) << TCC_SYNCBUSY_CC2_Pos)              /* (TCC_SYNCBUSY) Compare Channel 2 Busy Mask */
#define TCC_SYNCBUSY_CC2(value)               (TCC_SYNCBUSY_CC2_Msk & (_UINT32_(value) << TCC_SYNCBUSY_CC2_Pos)) /* Assigment of value for CC2 in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_CC3_Pos                  _UINT32_(11)                                         /* (TCC_SYNCBUSY) Compare Channel 3 Busy Position */
#define TCC_SYNCBUSY_CC3_Msk                  (_UINT32_(0x1) << TCC_SYNCBUSY_CC3_Pos)              /* (TCC_SYNCBUSY) Compare Channel 3 Busy Mask */
#define TCC_SYNCBUSY_CC3(value)               (TCC_SYNCBUSY_CC3_Msk & (_UINT32_(value) << TCC_SYNCBUSY_CC3_Pos)) /* Assigment of value for CC3 in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_CC4_Pos                  _UINT32_(12)                                         /* (TCC_SYNCBUSY) Compare Channel 4 Busy Position */
#define TCC_SYNCBUSY_CC4_Msk                  (_UINT32_(0x1) << TCC_SYNCBUSY_CC4_Pos)              /* (TCC_SYNCBUSY) Compare Channel 4 Busy Mask */
#define TCC_SYNCBUSY_CC4(value)               (TCC_SYNCBUSY_CC4_Msk & (_UINT32_(value) << TCC_SYNCBUSY_CC4_Pos)) /* Assigment of value for CC4 in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_CC5_Pos                  _UINT32_(13)                                         /* (TCC_SYNCBUSY) Compare Channel 5 Busy Position */
#define TCC_SYNCBUSY_CC5_Msk                  (_UINT32_(0x1) << TCC_SYNCBUSY_CC5_Pos)              /* (TCC_SYNCBUSY) Compare Channel 5 Busy Mask */
#define TCC_SYNCBUSY_CC5(value)               (TCC_SYNCBUSY_CC5_Msk & (_UINT32_(value) << TCC_SYNCBUSY_CC5_Pos)) /* Assigment of value for CC5 in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_Msk                      _UINT32_(0x00003FFF)                                 /* (TCC_SYNCBUSY) Register Mask  */

#define TCC_SYNCBUSY_CC_Pos                   _UINT32_(8)                                          /* (TCC_SYNCBUSY Position) Compare Channel 5 Busy */
#define TCC_SYNCBUSY_CC_Msk                   (_UINT32_(0x3F) << TCC_SYNCBUSY_CC_Pos)              /* (TCC_SYNCBUSY Mask) CC */
#define TCC_SYNCBUSY_CC(value)                (TCC_SYNCBUSY_CC_Msk & (_UINT32_(value) << TCC_SYNCBUSY_CC_Pos)) 

/* -------- TCC_WAVE : (TCC Offset: 0x3C) (R/W 32) Waveform Control -------- */
#define TCC_WAVE_RESETVALUE                   _UINT32_(0x00)                                       /*  (TCC_WAVE) Waveform Control  Reset Value */

#define TCC_WAVE_WAVEGEN_Pos                  _UINT32_(0)                                          /* (TCC_WAVE) Waveform Generation Position */
#define TCC_WAVE_WAVEGEN_Msk                  (_UINT32_(0x7) << TCC_WAVE_WAVEGEN_Pos)              /* (TCC_WAVE) Waveform Generation Mask */
#define TCC_WAVE_WAVEGEN(value)               (TCC_WAVE_WAVEGEN_Msk & (_UINT32_(value) << TCC_WAVE_WAVEGEN_Pos)) /* Assigment of value for WAVEGEN in the TCC_WAVE register */
#define   TCC_WAVE_WAVEGEN_NFRQ_Val           _UINT32_(0x0)                                        /* (TCC_WAVE) Normal frequency  */
#define   TCC_WAVE_WAVEGEN_MFRQ_Val           _UINT32_(0x1)                                        /* (TCC_WAVE) Match frequency  */
#define   TCC_WAVE_WAVEGEN_NPWM_Val           _UINT32_(0x2)                                        /* (TCC_WAVE) Normal PWM  */
#define   TCC_WAVE_WAVEGEN_DPWM_Val           _UINT32_(0x3)                                        /* (TCC_WAVE) Dual compare PWM  */
#define   TCC_WAVE_WAVEGEN_DSCRITICAL_Val     _UINT32_(0x4)                                        /* (TCC_WAVE) Dual-slope critical  */
#define   TCC_WAVE_WAVEGEN_DSBOTTOM_Val       _UINT32_(0x5)                                        /* (TCC_WAVE) Dual-slope with interrupt/event condition when COUNT reaches ZERO  */
#define   TCC_WAVE_WAVEGEN_DSBOTH_Val         _UINT32_(0x6)                                        /* (TCC_WAVE) Dual-slope with interrupt/event condition when COUNT reaches ZERO or TOP  */
#define   TCC_WAVE_WAVEGEN_DSTOP_Val          _UINT32_(0x7)                                        /* (TCC_WAVE) Dual-slope with interrupt/event condition when COUNT reaches TOP  */
#define TCC_WAVE_WAVEGEN_NFRQ                 (TCC_WAVE_WAVEGEN_NFRQ_Val << TCC_WAVE_WAVEGEN_Pos)  /* (TCC_WAVE) Normal frequency Position  */
#define TCC_WAVE_WAVEGEN_MFRQ                 (TCC_WAVE_WAVEGEN_MFRQ_Val << TCC_WAVE_WAVEGEN_Pos)  /* (TCC_WAVE) Match frequency Position  */
#define TCC_WAVE_WAVEGEN_NPWM                 (TCC_WAVE_WAVEGEN_NPWM_Val << TCC_WAVE_WAVEGEN_Pos)  /* (TCC_WAVE) Normal PWM Position  */
#define TCC_WAVE_WAVEGEN_DPWM                 (TCC_WAVE_WAVEGEN_DPWM_Val << TCC_WAVE_WAVEGEN_Pos)  /* (TCC_WAVE) Dual compare PWM Position  */
#define TCC_WAVE_WAVEGEN_DSCRITICAL           (TCC_WAVE_WAVEGEN_DSCRITICAL_Val << TCC_WAVE_WAVEGEN_Pos) /* (TCC_WAVE) Dual-slope critical Position  */
#define TCC_WAVE_WAVEGEN_DSBOTTOM             (TCC_WAVE_WAVEGEN_DSBOTTOM_Val << TCC_WAVE_WAVEGEN_Pos) /* (TCC_WAVE) Dual-slope with interrupt/event condition when COUNT reaches ZERO Position  */
#define TCC_WAVE_WAVEGEN_DSBOTH               (TCC_WAVE_WAVEGEN_DSBOTH_Val << TCC_WAVE_WAVEGEN_Pos) /* (TCC_WAVE) Dual-slope with interrupt/event condition when COUNT reaches ZERO or TOP Position  */
#define TCC_WAVE_WAVEGEN_DSTOP                (TCC_WAVE_WAVEGEN_DSTOP_Val << TCC_WAVE_WAVEGEN_Pos) /* (TCC_WAVE) Dual-slope with interrupt/event condition when COUNT reaches TOP Position  */
#define TCC_WAVE_RAMP_Pos                     _UINT32_(4)                                          /* (TCC_WAVE) Ramp Mode Position */
#define TCC_WAVE_RAMP_Msk                     (_UINT32_(0x3) << TCC_WAVE_RAMP_Pos)                 /* (TCC_WAVE) Ramp Mode Mask */
#define TCC_WAVE_RAMP(value)                  (TCC_WAVE_RAMP_Msk & (_UINT32_(value) << TCC_WAVE_RAMP_Pos)) /* Assigment of value for RAMP in the TCC_WAVE register */
#define   TCC_WAVE_RAMP_RAMP1_Val             _UINT32_(0x0)                                        /* (TCC_WAVE) RAMP1 operation  */
#define   TCC_WAVE_RAMP_RAMP2A_Val            _UINT32_(0x1)                                        /* (TCC_WAVE) Alternative RAMP2 operation  */
#define   TCC_WAVE_RAMP_RAMP2_Val             _UINT32_(0x2)                                        /* (TCC_WAVE) RAMP2 operation  */
#define   TCC_WAVE_RAMP_RAMP2C_Val            _UINT32_(0x3)                                        /* (TCC_WAVE) Critical RAMP2 operation  */
#define   TCC_WAVE_RAMP_RAMP2CS_Val           _UINT32_(0x4)                                        /* (TCC_WAVE) Critical Swapped RAMP2 operation  */
#define TCC_WAVE_RAMP_RAMP1                   (TCC_WAVE_RAMP_RAMP1_Val << TCC_WAVE_RAMP_Pos)       /* (TCC_WAVE) RAMP1 operation Position  */
#define TCC_WAVE_RAMP_RAMP2A                  (TCC_WAVE_RAMP_RAMP2A_Val << TCC_WAVE_RAMP_Pos)      /* (TCC_WAVE) Alternative RAMP2 operation Position  */
#define TCC_WAVE_RAMP_RAMP2                   (TCC_WAVE_RAMP_RAMP2_Val << TCC_WAVE_RAMP_Pos)       /* (TCC_WAVE) RAMP2 operation Position  */
#define TCC_WAVE_RAMP_RAMP2C                  (TCC_WAVE_RAMP_RAMP2C_Val << TCC_WAVE_RAMP_Pos)      /* (TCC_WAVE) Critical RAMP2 operation Position  */
#define TCC_WAVE_RAMP_RAMP2CS                 (TCC_WAVE_RAMP_RAMP2CS_Val << TCC_WAVE_RAMP_Pos)     /* (TCC_WAVE) Critical Swapped RAMP2 operation Position  */
#define TCC_WAVE_CIPEREN_Pos                  _UINT32_(7)                                          /* (TCC_WAVE) Circular period Enable Position */
#define TCC_WAVE_CIPEREN_Msk                  (_UINT32_(0x1) << TCC_WAVE_CIPEREN_Pos)              /* (TCC_WAVE) Circular period Enable Mask */
#define TCC_WAVE_CIPEREN(value)               (TCC_WAVE_CIPEREN_Msk & (_UINT32_(value) << TCC_WAVE_CIPEREN_Pos)) /* Assigment of value for CIPEREN in the TCC_WAVE register */
#define TCC_WAVE_CICCEN0_Pos                  _UINT32_(8)                                          /* (TCC_WAVE) Circular Channel 0 Enable Position */
#define TCC_WAVE_CICCEN0_Msk                  (_UINT32_(0x1) << TCC_WAVE_CICCEN0_Pos)              /* (TCC_WAVE) Circular Channel 0 Enable Mask */
#define TCC_WAVE_CICCEN0(value)               (TCC_WAVE_CICCEN0_Msk & (_UINT32_(value) << TCC_WAVE_CICCEN0_Pos)) /* Assigment of value for CICCEN0 in the TCC_WAVE register */
#define TCC_WAVE_CICCEN1_Pos                  _UINT32_(9)                                          /* (TCC_WAVE) Circular Channel 1 Enable Position */
#define TCC_WAVE_CICCEN1_Msk                  (_UINT32_(0x1) << TCC_WAVE_CICCEN1_Pos)              /* (TCC_WAVE) Circular Channel 1 Enable Mask */
#define TCC_WAVE_CICCEN1(value)               (TCC_WAVE_CICCEN1_Msk & (_UINT32_(value) << TCC_WAVE_CICCEN1_Pos)) /* Assigment of value for CICCEN1 in the TCC_WAVE register */
#define TCC_WAVE_CICCEN2_Pos                  _UINT32_(10)                                         /* (TCC_WAVE) Circular Channel 2 Enable Position */
#define TCC_WAVE_CICCEN2_Msk                  (_UINT32_(0x1) << TCC_WAVE_CICCEN2_Pos)              /* (TCC_WAVE) Circular Channel 2 Enable Mask */
#define TCC_WAVE_CICCEN2(value)               (TCC_WAVE_CICCEN2_Msk & (_UINT32_(value) << TCC_WAVE_CICCEN2_Pos)) /* Assigment of value for CICCEN2 in the TCC_WAVE register */
#define TCC_WAVE_CICCEN3_Pos                  _UINT32_(11)                                         /* (TCC_WAVE) Circular Channel 3 Enable Position */
#define TCC_WAVE_CICCEN3_Msk                  (_UINT32_(0x1) << TCC_WAVE_CICCEN3_Pos)              /* (TCC_WAVE) Circular Channel 3 Enable Mask */
#define TCC_WAVE_CICCEN3(value)               (TCC_WAVE_CICCEN3_Msk & (_UINT32_(value) << TCC_WAVE_CICCEN3_Pos)) /* Assigment of value for CICCEN3 in the TCC_WAVE register */
#define TCC_WAVE_POL0_Pos                     _UINT32_(16)                                         /* (TCC_WAVE) Channel 0 Polarity Position */
#define TCC_WAVE_POL0_Msk                     (_UINT32_(0x1) << TCC_WAVE_POL0_Pos)                 /* (TCC_WAVE) Channel 0 Polarity Mask */
#define TCC_WAVE_POL0(value)                  (TCC_WAVE_POL0_Msk & (_UINT32_(value) << TCC_WAVE_POL0_Pos)) /* Assigment of value for POL0 in the TCC_WAVE register */
#define TCC_WAVE_POL1_Pos                     _UINT32_(17)                                         /* (TCC_WAVE) Channel 1 Polarity Position */
#define TCC_WAVE_POL1_Msk                     (_UINT32_(0x1) << TCC_WAVE_POL1_Pos)                 /* (TCC_WAVE) Channel 1 Polarity Mask */
#define TCC_WAVE_POL1(value)                  (TCC_WAVE_POL1_Msk & (_UINT32_(value) << TCC_WAVE_POL1_Pos)) /* Assigment of value for POL1 in the TCC_WAVE register */
#define TCC_WAVE_POL2_Pos                     _UINT32_(18)                                         /* (TCC_WAVE) Channel 2 Polarity Position */
#define TCC_WAVE_POL2_Msk                     (_UINT32_(0x1) << TCC_WAVE_POL2_Pos)                 /* (TCC_WAVE) Channel 2 Polarity Mask */
#define TCC_WAVE_POL2(value)                  (TCC_WAVE_POL2_Msk & (_UINT32_(value) << TCC_WAVE_POL2_Pos)) /* Assigment of value for POL2 in the TCC_WAVE register */
#define TCC_WAVE_POL3_Pos                     _UINT32_(19)                                         /* (TCC_WAVE) Channel 3 Polarity Position */
#define TCC_WAVE_POL3_Msk                     (_UINT32_(0x1) << TCC_WAVE_POL3_Pos)                 /* (TCC_WAVE) Channel 3 Polarity Mask */
#define TCC_WAVE_POL3(value)                  (TCC_WAVE_POL3_Msk & (_UINT32_(value) << TCC_WAVE_POL3_Pos)) /* Assigment of value for POL3 in the TCC_WAVE register */
#define TCC_WAVE_POL4_Pos                     _UINT32_(20)                                         /* (TCC_WAVE) Channel 4 Polarity Position */
#define TCC_WAVE_POL4_Msk                     (_UINT32_(0x1) << TCC_WAVE_POL4_Pos)                 /* (TCC_WAVE) Channel 4 Polarity Mask */
#define TCC_WAVE_POL4(value)                  (TCC_WAVE_POL4_Msk & (_UINT32_(value) << TCC_WAVE_POL4_Pos)) /* Assigment of value for POL4 in the TCC_WAVE register */
#define TCC_WAVE_POL5_Pos                     _UINT32_(21)                                         /* (TCC_WAVE) Channel 5 Polarity Position */
#define TCC_WAVE_POL5_Msk                     (_UINT32_(0x1) << TCC_WAVE_POL5_Pos)                 /* (TCC_WAVE) Channel 5 Polarity Mask */
#define TCC_WAVE_POL5(value)                  (TCC_WAVE_POL5_Msk & (_UINT32_(value) << TCC_WAVE_POL5_Pos)) /* Assigment of value for POL5 in the TCC_WAVE register */
#define TCC_WAVE_SWAP0_Pos                    _UINT32_(24)                                         /* (TCC_WAVE) Swap DTI Output Pair 0 Position */
#define TCC_WAVE_SWAP0_Msk                    (_UINT32_(0x1) << TCC_WAVE_SWAP0_Pos)                /* (TCC_WAVE) Swap DTI Output Pair 0 Mask */
#define TCC_WAVE_SWAP0(value)                 (TCC_WAVE_SWAP0_Msk & (_UINT32_(value) << TCC_WAVE_SWAP0_Pos)) /* Assigment of value for SWAP0 in the TCC_WAVE register */
#define TCC_WAVE_SWAP1_Pos                    _UINT32_(25)                                         /* (TCC_WAVE) Swap DTI Output Pair 1 Position */
#define TCC_WAVE_SWAP1_Msk                    (_UINT32_(0x1) << TCC_WAVE_SWAP1_Pos)                /* (TCC_WAVE) Swap DTI Output Pair 1 Mask */
#define TCC_WAVE_SWAP1(value)                 (TCC_WAVE_SWAP1_Msk & (_UINT32_(value) << TCC_WAVE_SWAP1_Pos)) /* Assigment of value for SWAP1 in the TCC_WAVE register */
#define TCC_WAVE_SWAP2_Pos                    _UINT32_(26)                                         /* (TCC_WAVE) Swap DTI Output Pair 2 Position */
#define TCC_WAVE_SWAP2_Msk                    (_UINT32_(0x1) << TCC_WAVE_SWAP2_Pos)                /* (TCC_WAVE) Swap DTI Output Pair 2 Mask */
#define TCC_WAVE_SWAP2(value)                 (TCC_WAVE_SWAP2_Msk & (_UINT32_(value) << TCC_WAVE_SWAP2_Pos)) /* Assigment of value for SWAP2 in the TCC_WAVE register */
#define TCC_WAVE_SWAP3_Pos                    _UINT32_(27)                                         /* (TCC_WAVE) Swap DTI Output Pair 3 Position */
#define TCC_WAVE_SWAP3_Msk                    (_UINT32_(0x1) << TCC_WAVE_SWAP3_Pos)                /* (TCC_WAVE) Swap DTI Output Pair 3 Mask */
#define TCC_WAVE_SWAP3(value)                 (TCC_WAVE_SWAP3_Msk & (_UINT32_(value) << TCC_WAVE_SWAP3_Pos)) /* Assigment of value for SWAP3 in the TCC_WAVE register */
#define TCC_WAVE_Msk                          _UINT32_(0x0F3F0FB7)                                 /* (TCC_WAVE) Register Mask  */

#define TCC_WAVE_CICCEN_Pos                   _UINT32_(8)                                          /* (TCC_WAVE Position) Circular Channel x Enable */
#define TCC_WAVE_CICCEN_Msk                   (_UINT32_(0xF) << TCC_WAVE_CICCEN_Pos)               /* (TCC_WAVE Mask) CICCEN */
#define TCC_WAVE_CICCEN(value)                (TCC_WAVE_CICCEN_Msk & (_UINT32_(value) << TCC_WAVE_CICCEN_Pos)) 
#define TCC_WAVE_POL_Pos                      _UINT32_(16)                                         /* (TCC_WAVE Position) Channel x Polarity */
#define TCC_WAVE_POL_Msk                      (_UINT32_(0x3F) << TCC_WAVE_POL_Pos)                 /* (TCC_WAVE Mask) POL */
#define TCC_WAVE_POL(value)                   (TCC_WAVE_POL_Msk & (_UINT32_(value) << TCC_WAVE_POL_Pos)) 
#define TCC_WAVE_SWAP_Pos                     _UINT32_(24)                                         /* (TCC_WAVE Position) Swap DTI Output Pair 3 */
#define TCC_WAVE_SWAP_Msk                     (_UINT32_(0xF) << TCC_WAVE_SWAP_Pos)                 /* (TCC_WAVE Mask) SWAP */
#define TCC_WAVE_SWAP(value)                  (TCC_WAVE_SWAP_Msk & (_UINT32_(value) << TCC_WAVE_SWAP_Pos)) 

/* -------- TCC_WEXCTRL : (TCC Offset: 0x14) (R/W 32) Waveform Extension Configuration -------- */
#define TCC_WEXCTRL_RESETVALUE                _UINT32_(0x00)                                       /*  (TCC_WEXCTRL) Waveform Extension Configuration  Reset Value */

